# 创建一个文件
from openpyxl import Workbook
wb = Workbook() # create an excel file in ram
sheet = wb.active
# # print(sheet.title)
# sheet.title = "zhao kai niu bi"
# wb.save("excel_test.xlsx")
#
#
#
# # 写数据
# sheet["B9"] = "zhao kai"
# sheet["C9"] = "172,70,84"
# sheet["B10"] = "zhao li"
# sheet["C10"] = "168,48,84"
# sheet.append(["mama",158,67,88])


# # 打开一个已经存在的文件
from openpyxl import load_workbook
wb = load_workbook("excel_test.xlsx")
print(wb.sheetnames)
print(wb.get_sheet_names)
# sheet = wb.get_sheet_names("zhao kai niu bi")
# print(sheet)


# 获取指定区间内的值
# print(sheet["B2"].value)
# print(sheet["C1:C90"])
# for cell in sheet["C1:C90"]:
#     print(cell[0].value)
# for row in sheet:
#     # print(row)
#     for cell in row:
#         print(cell.value,end=".")
#     print()
# 1.心理.徐红豆.1921920001.
# 2.心理.汪丹丹.1921920002.
# 3.心理.朱梦艳.1921920003.
# 4.心理.林震.1921920004.
# 5.心理.王吟月.1921920005.
# 6.心理.邵呼雨.1921920006.
# 7.心理.张朝辉.1921920007.
# 8.心理.祁亚鹏.1921920008.
# 9.心理.顾文强.1921920009.
# 10.心理.郑坚.1921920010.
# 11.心理.巩馨雨.1921920011.
# 12.心理.梁轶睿.1921920012.
# 13.心理.刘蕾.1921920013.
# 14.心理.宋育雨.1921920014.
# 15.心理.季鑫.1921920015.
# 16.心理.张丽娜.1921920016.
# 17.心理.伦梓文.1921920017.
# 18.心理.乔嵩琳.1921920018.
# 19.心理.张铭港.1921920019.
# 20.心理.陈奕衡.1921920020.
# 21.心理.林立悦.1921920021.
# 22.心理.张陈平.1911516025.
# 23.心理.王贞.1911516026.
# 24.心理.王璐宁.1911516027.
# 25.心理.毛雪晨.1911516028.
# 26.心理.周宇.2011916001.
# 27.心理.周方园.2011916002.
# 28.心理.史冀龙.2011916003.
# 29.心理.黄琴.2011916004.
# 30.心理.李玉婷.2011916005.
# 31.心理.魏佳凝.2011916006.
# 32.心理.李姝桦.2011916007.
# 33.心理.杨扬.2011916008.
# 34.心理.赵凯.2021920001.
# 35.心理.山峡.2021920002.
# 36.心理.王怡萱.2021920003.
# 37.心理.赵明明.2021920004.
# 38.心理.许一丹.2021920005.
# 39.心理.徐雨扬.2021920006.
# 40.心理.李晶.2021920007.
# 41.心理.赵源.2021920008.
# 42.心理.张有兆.2021920009.
# 43.心理.吴慧娴.2021920010.
# 44.心理.黄芯怡.2021920011.
# 45.心理.张宇怡.2021920012.
# 46.心理.王彩卉.2021920013.
# 47.心理.于文婷.2021920014.
# 48.心理.周洁.2021920015.
# 49.心理.陈晓欣.2021920016.
# 50.心理.梁晨曦.2021920017.
# 51.心理.刘力锴.2021920018.
# 52.心理.冉秋燕.2021920019.
# 53.心理.王琳琪.2021920020.
# 54.心理.宁纪岚.2021920021.
# 55.心理.尚笑.2021920022.
# 56.心理.师凯雯.2021920023.
# 57.心理.王军博.2021920024.
# 58.心理.黄坤.2021920025.
# 59.心理.汪越.2121920001.
# 60.心理.刘子衿.2121920002.
# 61.心理.王剑.2121920003.
# 62.心理.姜欣汝.2121920004.
# 63.心理.姚雨蓝.2121920005.
# 64.心理.朱晓芸.2121920006.
# 65.心理.丁月怡.2121920007.
# 66.心理.黄勇强.2121920008.
# 67.心理.唐宏杰.2121920009.
# 68.心理.张萌.2121920010.
# 69.心理.张乐谱.2121920011.
# 70.心理.戴劲.2121920012.
# 71.心理.王朵朵.2121920013.
# 72.心理.张安琪.2121920014.
# 73.心理.辛子悦.2121920015.
# 74.心理.李军.2121920016.
# 75.心理.陈玉雪.2121920017.
# 76.心理.闫竹蕊.2121920018.
# 77.心理.李文星.2121920019.
# 78.心理.林海敏.2121920020.
# 79.心理.霍雨辰.2121920021.
# 80.心理.张娟娟.2121920022.
# 81.心理.陈滢.2121920023.
# 82.心理.武文艳.2121920024.
# 83.心理.李佳晨.2121920025.
# 84.心理.林依童.2111516017.
# 85.心理.周祺宸.2111516018.
# 86.心理.赵嘉怡.2111516019.
# 87.心理.刘旭东.2111516020.
# 88.心理.贾佳峰.2111516021.
# 89.心理.张苑.2111516022.
# 90.心理.张伟堃.2111516023.
# 91.心理.王姁如.2111516032.
# 92.心理.朱昊.2111516033.
# 93.心理.李丹阳.2111516034.
# 94.心理.赵祁伟.2111516035.
# 95.心理.于洋澜.2111516036.

# 取某个区间内的数值  按行循环
# for row in sheet.iter_rows(min_row=34,max_row=58,max_col=3):
#         for cell in row:
#             print(cell.value,end="+")
#         print()

# 取某个区间内的数值  按列循环
# for col in sheet.columns:
#     for cell in col:
#         print(cell.value,end=".")
#     print()

# for col in sheet.iter_cols(min_col=3,max_col=4):
#     for cell in col:
#         print(cell.value,end=".")
#     print()


# 文件中修改某个值
# sheet["B5"] = "zhao kai"
# # 文件的保存
# wb.save("excel_test.xlsx")

# 改变文件中字体的格式
from openpyxl.styles import Font,colors,Alignment
myfont = Font(name="黑体",size=10,italic=True,color=colors.BLUE)
sheet["B5"].font = myfont
sheet["B5"].alignment = Alignment(vertical="center",horizontal="center" )











