a="赵凯凯 是一个很帅的 的人"
# print(a.center(50,"*")) # ********************赵凯是一个很帅的的人********************
# print(a.count("凯",0,2))  # 1   判断某个字符出现了几次
# print(a.endswith("人"))  # True  判断结尾是不是某个字母
# print(a.startswith("赵"))   # True  判断开头是不是某个字母
# print(a.find("凯"))  # 字符查找，返回-1 表示没有找到，如果找到了，就返回所查字符的索引
# print(a.isdigit())  # 判断是否是个整数
# m = ["赵凯","赵丽","妈妈","爸爸"]
# print("+".join(m))   #  拼接字符串  赵凯+赵丽+妈妈+爸爸
# print(a.replace("凯","丽",2))  # 字符串的替换 赵丽丽是一个很帅的的人
print(a.split())  # 字符串的分割  ['赵凯凯', '是一个很帅的', '的人']





